---
kind: property
id: P:Autodesk.Revit.DB.ViewScheduleExportOptions.HeadersFootersBlanks
source: html/432c134e-3333-a020-1ecd-a6411dd73369.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.HeadersFootersBlanks Property

Whether to export group headers, footers, and blank lines. Default is true.

## Syntax (C#)
```csharp
public bool HeadersFootersBlanks { get; set; }
```